

const tableDatatemp= [
    {
      num: "1",
      module_content: "计算机科学基础及热点领域",
      knowledge_point: "1.计算机发展历程；2.计算机科学课程体系的主要内容。",
      test: "期末卷面测试",
    },
    {
      num: "2",
      module_content: "计算机数据表示 ",
      knowledge_point:
        "1.数制转换；2.数的反码、原码、补码；3.ASCII字符编码; ",
      test: "期末卷面测试",
    },
    {
      num: "3",
      module_content: "计算机硬件系统及结构",
      knowledge_point:
        "1.图灵模型基本思想；2.冯.诺依曼模型特点及组成；3.计算机系统主要技术指标定义及性能评价：字长、时钟周期、运算速度、内存容量、I/O速率；4. 计算机硬件系统组成5.分层的存储体系及组织结构；6. I/O系统的组成；7. I/O接口的定义、功能；",
      test: "期末卷面测试",
    },
    {
      num: "4",
      module_content: "计算机系统软件",
      knowledge_point:
        "1.计算机软件系统组成2.操作系统概念、分类、功能；3.主流操作系统及特点",
      test: "在线测试和期末卷面测试",
    },
    {
      num: "5",
      module_content: "计算机硬件系统及结构",
      knowledge_point:
        "1.图灵模型基本思想；2.冯.诺依曼模型特点及组成；3.计算机系统主要技术指标定义及性能评价：字长、时钟周期、运算速度、内存容量、I/O速率；4. 计算机硬件系统组成5.分层的存储体系及组织结构；6. I/O系统的组成；7. I/O接口的定义、功能；",
      test: "期末卷面测试",
    },
    {
      num: "6",
      module_content: "数据结构及算法基础",
      knowledge_point:
        "1.算法的概念；2.算法的特性；3.递归、迭代、穷举、贪婪算法的基本思想及适用场景；4.算法描述工具；5.算法的评价指标中时间复杂度与空间复杂度的定义；6.线性表（包括栈、队列）、树、图等典型数据结构的定义、运算；7. 顺序查找、二分查找算法的基本思想；8. 直接插入排序和冒泡排序的基本思想；",
      test: "期末卷面测试",
    },
    {
      num: "7",
      module_content: "计算机网络基础",
      knowledge_point:
        "1．信号、信道、调制解调基本概念；2.不同类型数据通信方式及特点；3.计算机网络的资源子网与通信子网及组成；4.常用的有线和无线网络传输媒体；5.计算机网络中链路与通路的概念；6.计算机网络基本的拓扑结构及特点；7. OSI模型体系结构；8. 网络互连常用设备；9.TCP/IP体系结构；10.IP地址结构及编码方案；11.互联网提供的主要服务；",
      test: "在线测试和期末卷面测试",
    },
  ]
  export {
  tableDatatemp
  }